nvt/cooja-ng/src/msp430/msp430_cpu.c
/*
 * MSP430 CPU emulator — instruction execution engine
 *
 * Copyright (c) 2007, Swedish Institute of Computer Science.
 * C reimplementation 2026.
 */
#include "msp430_cpu.h"
#include "msp430_decode.h"
#include "msp430_config.h"
#ifdef HAVE_LIGHTNING
#include "msp430_jit.h"
#endif
#include <stdlib.h>
#include <string.h>
#include <stdio.h>

/* --- Constant generator tables --- */
/* CG1 (R2/SR): As=0 → SR, As=1 → abs addr, As=2 → 4, As=3 → 8 */
/* CG2 (R3):    As=0 → 0, As=1 → 1, As=2 → 2, As=3 → 0xFFFF */
static const uint32_t cg1_values[4] = { 0, 0, 4, 8 };
static const uint32_t cg2_values[4] = { 0, 1, 2, 0xFFFF };

/* --- Inline helpers --- */

static inline uint16_t read_word(const msp430_cpu_t *cpu, uint32_t addr) {
    return (uint16_t)(cpu->memory[addr] | (cpu->memory[addr + 1] << 8));
}

static inline uint32_t read_word20(const msp430_cpu_t *cpu, uint32_t addr) {
    /* Read 20-bit value: low word at addr, high nibble at addr+2 */
    uint32_t lo = cpu->memory[addr] | (cpu->memory[addr + 1] << 8);
    uint32_t hi = cpu->memory[addr + 2] | (cpu->memory[addr + 3] << 8);
    return lo | ((hi & 0xf) << 16);
}

static inline void write_word(msp430_cpu_t *cpu, uint32_t addr, uint16_t val) {
    cpu->memory[addr]     = val & 0xff;
    cpu->memory[addr + 1] = (val >> 8) & 0xff;
}

static inline void write_word20(msp430_cpu_t *cpu, uint32_t addr, uint32_t val) {
    cpu->memory[addr]     = val & 0xff;
    cpu->memory[addr + 1] = (val >> 8) & 0xff;
    cpu->memory[addr + 2] = (val >> 16) & 0xf;
    cpu->memory[addr + 3] = 0;
}

/* Resolve RAM mirror addresses (e.g., F2617: 0x200-0x9FF -> 0x1100-0x18FF) */
static inline uint32_t resolve_mirror(const msp430_cpu_t *cpu, uint32_t addr) {
    const msp430_config_t *cfg = cpu->config;
    if (cfg->ram_mirror_size &&
        addr >= cfg->ram_mirror_start &&
        addr < cfg->ram_mirror_start + cfg->ram_mirror_size) {
        return cfg->ram_start + (addr - cfg->ram_mirror_start);
    }
    return addr;
}

/* Memory read with IO dispatch */
static inline int mem_read(msp430_cpu_t *cpu, uint32_t addr, bool word) {
    if (addr < cpu->max_mem_io && cpu->io_read[addr]) {
        return cpu->io_read[addr](cpu->io_user_data[addr], addr, word, cpu->cycles);
    }
    addr = resolve_mirror(cpu, addr);
    if (addr >= cpu->max_mem) return 0;
    if (word) {
        return read_word(cpu, addr);
    }
    return cpu->memory[addr];
}

/* Invalidate JIT cache entries covering address range */
static inline void cache_invalidate(msp430_cpu_t *cpu, uint32_t addr) {
#ifdef HAVE_LIGHTNING
    if (!cpu->compiled_cache) return;
    /* Invalidate a small window around the written address.
     * An instruction can be up to 6 bytes, and a block starting before
     * the write could include this address. We clear entries for
     * (addr-4)...(addr+2) to be safe. */
    uint32_t lo = (addr >= 4) ? (addr - 4) >> 1 : 0;
    uint32_t hi = (addr + 2) >> 1;
    if (hi >= cpu->cache_size) hi = cpu->cache_size - 1;
    for (uint32_t i = lo; i <= hi; i++) {
        if (cpu->compiled_cache[i]) {
            msp430_jit_free((compiled_block_t *)cpu->compiled_cache[i]);
            cpu->compiled_cache[i] = NULL;
            cpu->block_exec_count[i] = 0;
        }
    }
#else
    (void)cpu; (void)addr;
#endif
}

/* Memory write with IO dispatch */
static inline void mem_write(msp430_cpu_t *cpu, uint32_t addr, int val, bool word) {
    if (addr < cpu->max_mem_io && cpu->io_write[addr]) {
        cpu->io_write[addr](cpu->io_user_data[addr], addr, val, word, cpu->cycles);
        return;
    }
    addr = resolve_mirror(cpu, addr);
    if (addr >= cpu->max_mem) return;
    /* no debug */
    if (word) {
        write_word(cpu, addr, (uint16_t)val);
    } else {
        cpu->memory[addr] = val & 0xff;
    }
    cache_invalidate(cpu, addr);
}

/* Read memory in appropriate mode: 0=byte, 1=word, 2=word20 */
static inline int mem_read_mode(msp430_cpu_t *cpu, uint32_t addr, int mode) {
    if (mode == 2) {
        /* WORD20: read 20-bit value as two words */
        uint32_t lo = mem_read(cpu, addr, true);
        uint32_t hi = mem_read(cpu, addr + 2, true);
        return (int)(lo | ((hi & 0xf) << 16));
    }
    return mem_read(cpu, addr, mode == 1);
}

/* Write memory in appropriate mode */
static inline void mem_write_mode(msp430_cpu_t *cpu, uint32_t addr, int val, int mode) {
    if (mode == 2) {
        /* WORD20 */
        mem_write(cpu, addr, val & 0xffff, true);
        mem_write(cpu, addr + 2, (val >> 16) & 0xf, true);
        return;
    }
    mem_write(cpu, addr, val, mode == 1);
}

static inline int16_t sign_extend_10(int val) {
    if (val & 0x200) val |= 0xfc00;
    return (int16_t)val;
}

static inline int32_t sign_extend_16(int val) {
    if (val & 0x8000) return val | (int32_t)0xffff0000;
    return val;
}

static inline int32_t sign_extend_20(int val) {
    if (val & 0x80000) return val | (int32_t)0xfff00000;
    return val;
}

/* --- Lifecycle --- */

void msp430_cpu_init(msp430_cpu_t *cpu, const msp430_config_t *config) {
    memset(cpu, 0, sizeof(*cpu));
    cpu->config = config;
    cpu->max_mem = config->max_mem;
    cpu->max_mem_io = config->max_mem_io;
    cpu->is_msp430x = config->is_msp430x;
    cpu->max_interrupt = config->max_interrupt;
    cpu->interrupt_max = -1;
    cpu->serviced_interrupt = -1;

    cpu->memory = (uint8_t *)calloc(cpu->max_mem, 1);

    /* IO dispatch tables */
    cpu->io_read     = (io_read_fn *)calloc(cpu->max_mem_io, sizeof(io_read_fn));
    cpu->io_write    = (io_write_fn *)calloc(cpu->max_mem_io, sizeof(io_write_fn));
    cpu->io_user_data = (void **)calloc(cpu->max_mem_io, sizeof(void *));

    /* Interrupt tables */
    int nvectors = config->max_interrupt + 1;
    cpu->interrupt_handler = (interrupt_handler_fn *)calloc(nvectors, sizeof(interrupt_handler_fn));
    cpu->interrupt_source  = (void **)calloc(nvectors, sizeof(void *));

    cpu->next_event_cycle = INT64_MAX;
    cpu->cycle_limit = INT64_MAX;
    cpu->last_execute_us = -1;

    /* JIT cache */
    cpu->cache_size = cpu->max_mem >> 1;
#ifdef HAVE_LIGHTNING
    cpu->compiled_cache = (void **)calloc(cpu->cache_size, sizeof(void *));
    cpu->block_exec_count = (int32_t *)calloc(cpu->cache_size, sizeof(int32_t));
    if (config->is_msp430x) {
        /* Disable JIT for MSP430X — the 0x1xxx opcode range overlaps
         * between single-op, CALLA, PUSHM/POPM, and extension words.
         * The JIT decoder can't reliably distinguish these, causing
         * data words to be compiled as RRXX instructions. */
        free(cpu->compiled_cache);
        cpu->compiled_cache = NULL;
        free(cpu->block_exec_count);
        cpu->block_exec_count = NULL;
    }
    cpu->jit_threshold = 100;
    cpu->jit_inblock_checks = 1;  /* default: on (needed for timer events in loops) */
    /* Check environment for overrides */
    {
        const char *env = getenv("MSPSIM_JIT_THRESHOLD");
        if (env) cpu->jit_threshold = atoi(env);
        env = getenv("MSPSIM_JIT_INBLOCK_CHECKS");
        if (env) cpu->jit_inblock_checks = atoi(env);
    }
    {
        static int jit_initialized = 0;
        if (!jit_initialized) {
            msp430_jit_init();
            jit_initialized = 1;
        }
    }
#endif
}

static void cache_clear_all(msp430_cpu_t *cpu);

void msp430_cpu_destroy(msp430_cpu_t *cpu) {
#ifdef HAVE_LIGHTNING
    /* Free compiled blocks */
    if (cpu->compiled_cache) {
        for (uint32_t i = 0; i < cpu->cache_size; i++) {
            if (cpu->compiled_cache[i]) {
                msp430_jit_free((compiled_block_t *)cpu->compiled_cache[i]);
            }
        }
        free(cpu->compiled_cache);
        cpu->compiled_cache = NULL;
    }
    free(cpu->block_exec_count);
    cpu->block_exec_count = NULL;
#endif

    free(cpu->memory);
    free(cpu->io_read);
    free(cpu->io_write);
    free(cpu->io_user_data);
    free(cpu->interrupt_handler);
    free(cpu->interrupt_source);

