nvt/cooja-ng/src/msp430/msp430_cpu.c
    /* Free event queue */
    /* Events are owned externally, just clear pointers */
    cpu->event_queue = NULL;
}

static void cache_clear_all(msp430_cpu_t *cpu) {
#ifdef HAVE_LIGHTNING
    if (cpu->compiled_cache) {
        for (uint32_t i = 0; i < cpu->cache_size; i++) {
            if (cpu->compiled_cache[i]) {
                msp430_jit_free((compiled_block_t *)cpu->compiled_cache[i]);
                cpu->compiled_cache[i] = NULL;
            }
            cpu->block_exec_count[i] = 0;
        }
    }
#else
    (void)cpu;
#endif
}

static void reevaluate_interrupts(msp430_cpu_t *cpu) {
    cpu->interrupt_max = -1;
    int n = cpu->max_interrupt + 1;
    for (int i = 0; i < n; i++) {
        if (cpu->interrupt_source[i] != NULL || cpu->interrupt_handler[i] != NULL) {
            cpu->interrupt_max = i;
        }
    }
}

void msp430_cpu_reset(msp430_cpu_t *cpu) {
    /* Clear interrupt state */
    int nvectors = cpu->max_interrupt + 1;
    memset(cpu->interrupt_source, 0, nvectors * sizeof(void *));
    memset(cpu->interrupt_handler, 0, nvectors * sizeof(interrupt_handler_fn));
    cpu->interrupt_max = -1;
    cpu->serviced_interrupt = -1;

    /* Clear registers */
    memset(cpu->reg, 0, sizeof(cpu->reg));
    cpu->interrupts_enabled = false;
    cpu->cpu_off = false;
    cpu->stopping = false;

    /* Clear events */
    cpu->event_queue = NULL;
    cpu->next_event_cycle = INT64_MAX;
    cpu->last_execute_us = -1;

    cpu->ext_word = 0;

    /* Clear decode cache */
    cache_clear_all(cpu);

    /* Flag reset interrupt */
    msp430_flag_interrupt(cpu, cpu->max_interrupt, NULL, NULL, true);
}

void msp430_stop(msp430_cpu_t *cpu) {
    cpu->stopping = true;
}

/* --- IO registration --- */

void msp430_register_io(msp430_cpu_t *cpu, uint32_t addr, uint32_t size,
                         io_read_fn read, io_write_fn write, void *data) {
    for (uint32_t i = 0; i < size; i++) {
        if (addr + i < cpu->max_mem_io) {
            cpu->io_read[addr + i] = read;
            cpu->io_write[addr + i] = write;
            cpu->io_user_data[addr + i] = data;
        }
    }
}

/* --- Interrupt management --- */

void msp430_flag_interrupt(msp430_cpu_t *cpu, int vector, void *source,
                            interrupt_handler_fn handler, bool set) {
    if (set) {
        cpu->interrupt_source[vector] = source ? source : (void *)1;
        cpu->interrupt_handler[vector] = handler;
        if (vector > cpu->interrupt_max) {
            cpu->interrupt_max = vector;
        }
        if (vector == cpu->max_interrupt) {
            /* Reset cannot be masked */
            cpu->interrupts_enabled = true;
            cpu->serviced_interrupt = -1;
        }
    } else {
        cpu->interrupt_source[vector] = NULL;
        cpu->interrupt_handler[vector] = NULL;
        reevaluate_interrupts(cpu);
    }
}

/* --- Event management (generated from shared template) --- */

#include "event_queue.h"
EVENT_QUEUE_IMPL(msp430, msp430_cpu_t, msp430_event_t)

/* --- Interrupt service --- */

static int service_interrupt(msp430_cpu_t *cpu, int pc) {
    int sp = cpu->reg[MSP430_SP];
    int sr = cpu->reg[MSP430_SR];
    int max_int = cpu->max_interrupt;
    int vec = cpu->interrupt_max;

    if (vec < max_int) {
        /* Push PC and SR to stack */
        sp -= 2;
        cpu->reg[MSP430_SP] = sp;
        mem_write(cpu, sp, pc & 0xffff, true);

        sp -= 2;
        cpu->reg[MSP430_SP] = sp;
        mem_write(cpu, sp, (sr & 0x0fff) | ((pc & 0xf0000) >> 4), true);
    }

    /* Clear SR (disables interrupts, exits LPM) */
    cpu->reg[MSP430_SR] = 0;
    cpu->interrupts_enabled = false;
    cpu->cpu_off = false;

    /* Read interrupt vector */
    int vector_addr = 0xfffe - (max_int - vec) * 2;
    pc = read_word(cpu, vector_addr);
    cpu->reg[MSP430_PC] = pc;

    cpu->serviced_interrupt = vec;
    interrupt_handler_fn handler = cpu->interrupt_handler[vec];
    void *source = cpu->interrupt_source[vec];

    /* Clear this interrupt source */
    cpu->interrupt_source[vec] = NULL;
    cpu->interrupt_handler[vec] = NULL;
    reevaluate_interrupts(cpu);

    /* Handle reset */
    if (vec == max_int) {
        /* Full reset: clear all interrupt state, keep memory/config */
        int nvectors = max_int + 1;
        memset(cpu->interrupt_source, 0, nvectors * sizeof(void *));
        memset(cpu->interrupt_handler, 0, nvectors * sizeof(interrupt_handler_fn));
        cpu->interrupt_max = -1;
        cpu->serviced_interrupt = -1;
        cpu->event_queue = NULL;
        cpu->next_event_cycle = INT64_MAX;
    }

    /* 6 cycles for interrupt service */
    cpu->cycles += 6;

    /* Notify handler */
    if (handler) {
        handler(source, vec);
    }

    return pc;
}

/* --- Write to SR with side effects --- */

static inline void write_sr(msp430_cpu_t *cpu, uint32_t val) {
    bool old_ie = cpu->interrupts_enabled;
    cpu->reg[MSP430_SR] = val;
    cpu->interrupts_enabled = (val & SR_GIE) != 0;
    cpu->cpu_off = (val & SR_CPUOFF) != 0;

    /* When GIE transitions 0→1 while servicing an interrupt, the current
     * interrupt is considered done and pending interrupts can fire.
     * Matches Java MSPSim's handlePendingInterrupts() call in SR write. */
    if (!old_ie && cpu->interrupts_enabled && cpu->serviced_interrupt >= 0) {
        reevaluate_interrupts(cpu);
        cpu->serviced_interrupt = -1;
    }
}

/* Write SR for flag-only updates (no LPM checks needed) */
static inline void write_sr_flags(msp430_cpu_t *cpu, uint32_t val) {
    cpu->reg[MSP430_SR] = val;
}

/* Handle pending interrupts (after RETI) */
static inline void handle_pending_interrupts(msp430_cpu_t *cpu) {
    reevaluate_interrupts(cpu);
    cpu->serviced_interrupt = -1;
}

/* Forward declaration — the original interpreter, renamed */
static int msp430_step_interpreter(msp430_cpu_t *cpu, int count);

/* ===================================================================
 * DECODED INSTRUCTION EXECUTION ENGINE
 * =================================================================== */

