nvt/cooja-ng/src/msp430/msp430_cpu.c
/*
 * Execute a single decoded instruction.
 * Returns 1 on success, 0 if the instruction needs special handling
 * (e.g., RETI, or CPU state changed).
 */
static int execute_decoded(msp430_cpu_t *cpu, const decoded_insn_t *di, uint32_t next_pc) {
    uint32_t *reg = cpu->reg;

    switch (di->itype) {
    case ITYPE_TWO_OP: {
        int op = di->operation;
        bool bw = di->byte_mode;
        uint32_t mask = bw ? 0xff : 0xffff;
        uint32_t msb_bit = bw ? 0x80 : 0x8000;
        int mode_bytes = bw ? 1 : 2;
        bool dst_reg_mode = (di->dst_kind == OPKIND_REG);
        int src = 0, dst = 0;
        int dst_address = -1;

        /* --- Resolve source --- */
        switch (di->src_kind) {
        case OPKIND_REG:
            src = reg[di->src_reg] & mask;
            cpu->cycles += dst_reg_mode ? 1 : 4;
            if (di->dst_reg == MSP430_PC && dst_reg_mode) cpu->cycles += 1;
            break;
        case OPKIND_CG:
            src = di->src_value;
            if (bw && di->src_reg == MSP430_CG2 && src == (int32_t)0xFFFF) src = 0xff;
            cpu->cycles += dst_reg_mode ? 1 : 4;
            break;
        case OPKIND_INDEXED: {
            uint32_t rval = reg[di->src_reg];
            uint32_t addr;
            if (rval <= 0xffff) {
                addr = (rval + di->src_value) & 0xffff;
            } else {
                addr = (rval + di->src_value) & 0xfffff;
            }
            src = mem_read(cpu, addr, !bw);
            if (bw) src &= 0xff;
            cpu->cycles += dst_reg_mode ? 3 : 6;
            break;
        }
        case OPKIND_ABSOLUTE:
            src = mem_read(cpu, (uint32_t)(uint16_t)di->src_value, !bw);
            if (bw) src &= 0xff;
            cpu->cycles += dst_reg_mode ? 3 : 6;
            break;
        case OPKIND_INDIRECT:
            src = mem_read(cpu, reg[di->src_reg], !bw);
            if (bw) src &= 0xff;
            cpu->cycles += dst_reg_mode ? 2 : 5;
            break;
        case OPKIND_AUTOINC:
            src = mem_read(cpu, reg[di->src_reg], !bw);
            if (bw) src &= 0xff;
            reg[di->src_reg] += mode_bytes;
            cpu->cycles += dst_reg_mode ? 2 : 5;
            if (di->dst_reg == MSP430_PC && dst_reg_mode) cpu->cycles += 1;
            break;
        case OPKIND_IMMEDIATE:
            src = di->src_value;
            if (bw) src &= 0xff;
            cpu->cycles += dst_reg_mode ? 2 : 5;
            if (di->dst_reg == MSP430_PC && dst_reg_mode) cpu->cycles += 1;
            break;
        }

        /* --- Resolve destination --- */
        if (dst_reg_mode) {
            if (op != OP_MOV) dst = reg[di->dst_reg] & mask;
        } else {
            /* Indexed or absolute dst */
            if (di->dst_kind == OPKIND_ABSOLUTE) {
                dst_address = (uint32_t)(uint16_t)di->dst_value;
            } else {
                uint32_t rval = reg[di->dst_reg];
                if (rval <= 0xffff) {
                    dst_address = (rval + di->dst_value) & 0xffff;
                } else {
                    dst_address = (rval + di->dst_value) & 0xfffff;
                }
            }
            if (op != OP_MOV) {
                dst = mem_read(cpu, dst_address, !bw);
                if (bw) dst &= 0xff;
            }
        }

        /* --- ALU --- */
        bool write_result = false;
        bool update_status = true;
        uint32_t sr = reg[MSP430_SR];

        switch (op) {
        case OP_MOV:
            dst = src;
            write_result = true;
            update_status = false;
            break;
        case OP_ADD: {
            sr &= ~(SR_V | SR_C);
            uint32_t tmp = (src ^ dst) & msb_bit;
            dst = dst + src;
            if ((uint32_t)dst > mask) sr |= SR_C;
            if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
            write_sr_flags(cpu, sr);
            write_result = true;
            break;
        }
        case OP_ADDC: {
            int carry = (sr & SR_C) ? 1 : 0;
            sr &= ~(SR_V | SR_C);
            uint32_t tmp = (src ^ dst) & msb_bit;
            dst = dst + src + carry;
            if ((uint32_t)dst > mask) sr |= SR_C;
            if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
            write_sr_flags(cpu, sr);
            write_result = true;
            break;
        }
        case OP_SUB: {
            /* Match MSPSim: 16-bit complement even for byte mode.
             * This affects carry flag for SUB.B when src > dst. */
            src = (src ^ 0xffff) & 0xffff;
            sr &= ~(SR_V | SR_C);
            uint32_t tmp = (src ^ dst) & msb_bit;
            dst = dst + src + 1;
            if ((uint32_t)dst > mask) sr |= SR_C;
            if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
            write_sr_flags(cpu, sr);
            write_result = true;
            break;
        }
        case OP_SUBC: {
            int carry = (sr & SR_C) ? 1 : 0;
            src = (src ^ 0xffff) & 0xffff;
            sr &= ~(SR_V | SR_C);
            uint32_t tmp = (src ^ dst) & msb_bit;
            dst = dst + src + carry;
            if ((uint32_t)dst > mask) sr |= SR_C;
            if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
            write_sr_flags(cpu, sr);
            write_result = true;
            break;
        }
        case OP_CMP: {
            sr = (sr & ~(SR_C | SR_V)) | ((uint32_t)dst >= (uint32_t)src ? SR_C : 0);
            int tmp = dst - src;
            if (((src ^ tmp) & msb_bit) == 0 && ((src ^ dst) & msb_bit) != 0) {
                sr |= SR_V;
            }
            write_sr_flags(cpu, sr);
            dst = tmp;
            write_result = false;
            break;
        }
        case OP_DADD:
            dst = dst + src + ((sr & SR_C) ? 1 : 0);
            write_result = true;
            break;
        case OP_BIT:
            dst = src & dst;
            sr = (sr & ~(SR_C | SR_V)) | ((dst != 0) ? SR_C : 0);
            write_sr_flags(cpu, sr);
            write_result = false;
            break;
        case OP_BIC:
            dst = (~src) & dst;
            write_result = true;
            update_status = false;
            break;
        case OP_BIS:
            dst = src | dst;
            write_result = true;
            update_status = false;
            break;
        case OP_XOR: {
            sr &= ~(SR_C | SR_V);
            if ((src & msb_bit) && (dst & msb_bit)) sr |= SR_V;
            dst = src ^ dst;
            if (dst != 0) sr |= SR_C;
            write_sr_flags(cpu, sr);
            write_result = true;
            break;
        }
        case OP_AND: {
            sr &= ~(SR_C | SR_V);
            dst = src & dst;
            if (dst != 0) sr |= SR_C;
            write_sr_flags(cpu, sr);
            write_result = true;
            break;
        }
        }

        dst &= mask;

        if (write_result) {
            if (dst_reg_mode) {
                if (di->dst_reg == MSP430_SR) {
                    write_sr(cpu, dst);
                } else {
                    reg[di->dst_reg] = dst & 0xfffff;
                }
            } else {
                mem_write(cpu, dst_address, dst, !bw);
            }
        }

        if (update_status) {
            sr = reg[MSP430_SR];
            sr = (sr & ~(SR_Z | SR_N)) |
                 ((dst == 0) ? SR_Z : 0) |
                 ((dst & msb_bit) ? SR_N : 0);
            write_sr_flags(cpu, sr);
        }

        if (!(dst_reg_mode && di->dst_reg == MSP430_PC && write_result)) {
            reg[MSP430_PC] = next_pc;
        }
        return 1;
    }

    case ITYPE_JUMP: {
        cpu->cycles += 2;
        uint32_t sr = reg[MSP430_SR];
        bool jump;
        switch (di->jmp_condition) {
        case JMP_JNE: jump = (sr & SR_Z) == 0; break;
        case JMP_JEQ: jump = (sr & SR_Z) != 0; break;
        case JMP_JNC: jump = (sr & SR_C) == 0; break;
        case JMP_JC:  jump = (sr & SR_C) != 0; break;
        case JMP_JN:  jump = (sr & SR_N) != 0; break;
        case JMP_JGE: jump = ((sr & SR_N) != 0) == ((sr & SR_V) != 0); break;
        case JMP_JL:  jump = ((sr & SR_N) != 0) != ((sr & SR_V) != 0); break;
        case JMP_JMP: jump = true; break;
        default: jump = false; break;
        }
        if (jump) {
            reg[MSP430_PC] = (next_pc + di->jmp_offset) &
                             (cpu->is_msp430x ? 0xfffff : 0xffff);
        } else {
            reg[MSP430_PC] = next_pc;
        }
        return 1;
    }

    default:
        /* Single-op, MSP430X — fall back to interpreter */
        return 0;
    }
}

#ifdef HAVE_LIGHTNING
/*
 * Execute a decoded instruction from JIT-compiled code.
 * This is called by JIT code for instructions it can't inline.
 * Must be a non-static function so the JIT can call it.
 */
int execute_decoded_for_jit(msp430_cpu_t *cpu, const decoded_insn_t *di,
                            uint32_t next_pc) {
    int result = execute_decoded(cpu, di, next_pc);
    if (!result) {
        /* Fall back to interpreter for this single instruction */
        cpu->reg[MSP430_PC] = next_pc - di->size;
        cpu->ext_word = di->ext_word;
        msp430_step_interpreter(cpu, 1);
        return 1;
    }
    return result;
}
#endif


/* ===================================================================
 * MAIN EXECUTION ENGINE
 * =================================================================== */

/* #define JIT_VERIFY 1 */  /* Enable to compare JIT vs interpreter */

