nvt/cooja-ng/src/msp430/msp430_cpu.c
int msp430_step(msp430_cpu_t *cpu, int count) {
#ifdef HAVE_LIGHTNING
    if (cpu->compiled_cache) {
        while (count > 0) {
            /* Event processing */
            if (cpu->cycles >= cpu->next_event_cycle) {
                execute_events(cpu);
            }

            /* Interrupt service — same logic as interpreter */
            if (cpu->interrupts_enabled && cpu->serviced_interrupt == -1
                    && cpu->interrupt_max >= 0) {
                service_interrupt(cpu, cpu->reg[MSP430_PC]);
            }

            /* LPM: use interpreter for low-power mode handling */
            if (cpu->cpu_off) {
                int batch = count < 1000 ? count : 1000;
                int rem = msp430_step_interpreter(cpu, batch);
                count -= (batch - rem);
                if (cpu->cycles >= cpu->cycle_limit)
                    return count;
                continue;
            }

            if (cpu->stopping) {
                cpu->stopping = false;
                return count;
            }

            /* Try JIT block at current PC */
            uint32_t pc = cpu->reg[MSP430_PC];
            uint32_t ci = pc >> 1;

            if (ci < cpu->cache_size) {
                compiled_block_t *cb =
                    (compiled_block_t *)cpu->compiled_cache[ci];
                if (cb && count >= cb->length &&
                    cpu->cycles + cb->length * 6 <
                        cpu->next_event_cycle) {
#ifdef JIT_VERIFY
                    /* Save state before JIT execution */
                    uint32_t save_reg[16];
                    memcpy(save_reg, cpu->reg, sizeof(save_reg));
                    int64_t save_cycles = cpu->cycles;

                    int executed = cb->fn(cpu);
                    if (executed > 0) {
                        /* Save JIT results */
                        uint32_t jit_reg[16];
                        memcpy(jit_reg, cpu->reg, sizeof(jit_reg));
                        int64_t jit_cycles = cpu->cycles;

                        /* Restore and run interpreter */
                        memcpy(cpu->reg, save_reg, sizeof(save_reg));
                        cpu->cycles = save_cycles;
                        cpu->interrupts_enabled = (save_reg[MSP430_SR] & SR_GIE) != 0;
                        cpu->cpu_off = (save_reg[MSP430_SR] & SR_CPUOFF) != 0;
                        msp430_step_interpreter(cpu, executed);

                        /* Compare */
                        int mismatch = 0;
                        for (int r = 0; r < 16; r++) {
                            if (jit_reg[r] != cpu->reg[r]) {
                                if (!mismatch) fprintf(stderr,
                                    "JIT MISMATCH at PC=0x%04x (block len=%d, executed=%d):\n",
                                    save_reg[0], cb->length, executed);
                                fprintf(stderr, "  R%d: JIT=0x%05x INTERP=0x%05x\n",
                                        r, jit_reg[r], cpu->reg[r]);
                                mismatch = 1;
                            }
                        }
                        if (jit_cycles != cpu->cycles && !mismatch) {
                            fprintf(stderr,
                                "JIT CYCLE MISMATCH at PC=0x%04x: JIT=%lld INTERP=%lld\n",
                                save_reg[0], (long long)jit_cycles,
                                (long long)cpu->cycles);
                        }

                        cpu->instructions += executed;
                        count -= executed;
                        if (cpu->cycles >= cpu->cycle_limit)
                            return count;
                        continue;
                    }
#else
                    int executed = cb->fn(cpu);
                    if (executed > 0) {
                        cpu->instructions += executed;
                        count -= executed;
                        /* Tight JIT chain: keep executing compiled blocks.
                           Check events and interrupts between blocks. */
                        while (count > 0 &&
                               cpu->cycles < cpu->next_event_cycle &&
                               cpu->interrupt_max < 0) {
                            pc = cpu->reg[MSP430_PC];
                            ci = pc >> 1;
                            if (ci >= cpu->cache_size) break;
                            cb = (compiled_block_t *)
                                cpu->compiled_cache[ci];
                            if (!cb || count < cb->length) break;
                            executed = cb->fn(cpu);
                            if (executed <= 0) break;
                            cpu->instructions += executed;
                            count -= executed;
                        }
                        if (cpu->cycles >= cpu->cycle_limit)
                            return count;
                        continue;
                    }
#endif
                }
                /* Hot block counting */
                if (!cb && cpu->block_exec_count[ci] >= 0) {
                    cpu->block_exec_count[ci]++;
                    if (cpu->block_exec_count[ci] >= cpu->jit_threshold) {
                        basic_block_t block;
                        msp430_decode_block(cpu->memory, pc,
                                            cpu->max_mem, &block);
                        compiled_block_t *ncb =
                            msp430_jit_compile(&block, cpu);
                        if (ncb) {
                            cpu->compiled_cache[ci] = ncb;
                            continue; /* re-check with compiled block */
                        } else {
                            cpu->block_exec_count[ci] = -1000000;
                        }
                    }
                }
            }

            /* Interpreter batch, then re-check JIT */
            {
                int batch = count < 32 ? count : 32;
                int rem = msp430_step_interpreter(cpu, batch);
                count -= (batch - rem);
                if (cpu->cycles >= cpu->cycle_limit)
                    return count;
            }
        }
        return count;
    }
#endif
    return msp430_step_interpreter(cpu, count);
}

