nvt/cooja-ng/src/msp430/msp430_cpu.c
void msp430_step_until(msp430_cpu_t *cpu, int64_t target_cycle) {
    if (cpu->cycles >= target_cycle) return;
    cpu->cycle_limit = target_cycle;
    while (cpu->cycles < target_cycle) {
        /* Estimate instructions needed.
         * Use large batches for efficiency (JIT path has per-instruction overhead).
         * Overshooting is handled by the while loop condition. */
        int64_t remaining = target_cycle - cpu->cycles;
        int steps;
        if (remaining > 50000) {
            steps = 10000;
        } else if (remaining <= 10) {
            /* Single-step near target to match MSPSim's per-instruction
             * cycle check. Prevents LPM→event→ISR overshoot that causes
             * 29+ tick Timer B outliers and TSCH desync. */
            steps = 1;
        } else {
            steps = (int)(remaining / 3);
            if (steps < 1) steps = 1;
            if (steps > 10000) steps = 10000;
        }
        msp430_step(cpu, steps);
    }
    /* Process events that became due at the boundary.  The LPM handler
     * fast-forwards cycles to min(next_event_cycle, cycle_limit).  When
     * next_event_cycle == cycle_limit the loop exits before the top-of-
     * loop event check runs, leaving the timer interrupt unfired.
     * MSPSim fires events after every instruction — we must match that. */
    while (cpu->cycles >= cpu->next_event_cycle)
        execute_events(cpu);

    cpu->cycle_limit = INT64_MAX;
    /* Keep sim_time_ns synchronized with cycles */
    if (cpu->cpu_freq_hz > 0) {
        cpu->sim_time_ns = msp430_cycles_to_ns(cpu->cycles, cpu->cpu_freq_hz);
    }
}

int64_t msp430_step_micros(msp430_cpu_t *cpu, int64_t jump_us, int64_t execute_us) {
    if (jump_us < 0) jump_us = 0;
    if (execute_us < 0) execute_us = 0;

    /* Exact MSPSim stepMicros replication:
     * - lastMicrosDelta accumulates ALL jump values (never reset)
     * - lastMicrosCycles is set ONCE (first call) and NEVER changes
     * - maxCycles = lastMicrosCycles + ((lastMicrosDelta + executeMicros) * dcoFrq) / 1e6
     * This does ONE integer division for the total accumulated time,
     * bounding truncation error to 1 cycle total (not 1 per tick). */

    /* Initialize on first call */
    if (!cpu->micro_clock_ready) {
        cpu->last_micros_cycles = cpu->cycles;
        cpu->last_micros_delta = 0;
        cpu->micro_clock_ready = true;
    }

    /* Accumulate jump (matches: lastMicrosDelta += jumpMicros) */
    cpu->last_micros_delta += jump_us;

    /* Compute target from ORIGINAL base + TOTAL accumulated delta
     * (matches: maxCycles = lastMicrosCycles + ((lastMicrosDelta + executeMicros) * dcoFrq) / 1e6) */
    int64_t target_cycle = cpu->last_micros_cycles +
        ((cpu->last_micros_delta + execute_us) * (int64_t)cpu->cpu_freq_hz) / 1000000LL;

    if (target_cycle > cpu->cycles)
        msp430_step_until(cpu, target_cycle);

    if (cpu->cpu_off &&
        !(cpu->interrupts_enabled &&
          cpu->serviced_interrupt == -1 &&
          cpu->interrupt_max >= 0) &&
        cpu->cpu_freq_hz > 0 &&
        cpu->next_event_cycle > cpu->cycles) {
        return ((cpu->next_event_cycle - cpu->cycles) * 1000000LL) /
               cpu->cpu_freq_hz;
    }
    return 0;
}

/* ===================================================================
 * INTERPRETER EXECUTION ENGINE (original)
 * =================================================================== */

static int msp430_step_interpreter(msp430_cpu_t *cpu, int count) {
    uint32_t *reg = cpu->reg;
    uint8_t *memory = cpu->memory;
    uint32_t max_mem = cpu->max_mem;

/* --- Computed goto dispatch table --- */
#if defined(__GNUC__) || defined(__clang__)
    static const void *dispatch_table[16] = {
        &&op_msp430x, &&op_single, &&op_jump, &&op_jump,
        &&op_mov, &&op_add, &&op_addc, &&op_subc,
        &&op_sub, &&op_cmp, &&op_dadd, &&op_bit,
        &&op_bic, &&op_bis, &&op_xor, &&op_and
    };
    #define DISPATCH(opcode) goto *dispatch_table[opcode]
    #define OP_LABEL(name) name
#else
    #define DISPATCH(opcode) switch(opcode)
    #define OP_LABEL(name) case name
#endif

    while (count > 0) {
        /* Match MSPSim execution order: INTERRUPTS → LPM → INSTRUCTION → EVENTS.
         * MSPSim fires events AFTER instruction execution (emulateOP line 2080),
         * while interrupts are checked BEFORE (line 913). This ensures that
         * after RETI, the interrupted context executes at least one instruction
         * before newly-fired timer events trigger the next ISR. */

        /* Interrupt processing (BEFORE instruction, matching MSPSim line 913) */
        if (cpu->interrupts_enabled && cpu->serviced_interrupt == -1
                && cpu->interrupt_max >= 0) {
            service_interrupt(cpu, reg[MSP430_PC]);
            /* If interrupt entry pushed us past cycle_limit, stop.
             * This prevents overshoot when LPM wake → event → ISR
             * happens within a single step iteration. */
            if (cpu->cycles >= cpu->cycle_limit) {
                return count - 1;
            }
        }

        /* LPM check */
        if (cpu->cpu_off) {
            /* In low-power mode, advance to next event (capped by cycle_limit) */
            if (cpu->interrupts_enabled && cpu->interrupt_max >= 0) {
                /* Will service interrupt next iteration */
            } else {
                int64_t target = cpu->next_event_cycle;
                if (target > cpu->cycle_limit) target = cpu->cycle_limit;
                cpu->cycles = target;
                /* Process events that became due during LPM fast-forward */
                if (cpu->cycles >= cpu->next_event_cycle)
                    execute_events(cpu);
                if (cpu->cycles >= cpu->cycle_limit) {
                    return count - 1;  /* ran this "instruction" (LPM tick) */
                }
            }
            count--;
            continue;
        }

        if (cpu->stopping) {
            cpu->stopping = false;
            return count;
        }

        cpu->instructions++;

        /* Fetch instruction */
        uint32_t pc = reg[MSP430_PC];
        if (pc + 1 >= max_mem) {
            return count;
        }

        uint16_t instr = memory[pc] | (memory[pc + 1] << 8);
        cpu->last_pc = pc;

