nvt/cooja-ng/src/msp430/msp430_cpu.c
        /* PC-range trace hook (for debugging specific firmware functions) */
        if (cpu->pc_trace_fn && pc >= cpu->pc_trace_lo && pc < cpu->pc_trace_hi)
            cpu->pc_trace_fn(cpu->pc_trace_data, pc, reg, memory);




        int op = (instr >> 12) & 0xf;

#if defined(__GNUC__) || defined(__clang__)
        DISPATCH(op);
#else
        switch (op) {
#endif

        /* ===================================================================
         * MSP430X / Single-operand / Extension word (opcode 0)
         * =================================================================== */
        OP_LABEL(op_msp430x): {
            /* Check if this is an extension word (bit 11 set = 0x1800 prefix) */
            if ((instr & 0xf800) == 0x1800) {
                /* Extension word for next instruction */
                int ext = instr;
                cpu->ext_word = ext;
                pc += 2;
                /* Fetch the actual instruction */
                instr = memory[pc] | (memory[pc + 1] << 8);
                cpu->last_instruction = instr;
                op = (instr >> 12) & 0xf;

                /* Dispatch the extended instruction.
                 * Two-op (opcodes 4-15): use extended two-op path.
                 * Single-op (opcode 1): use single-op path (which handles ext_word).
                 * Jump (opcodes 2-3): rare with extension; route to single-op. */
                if (op >= 4) {
                    goto extended_twoop;
                } else {
                    /* Single-op with extension word — route to op_single.
                     * op_single will check ext_word for 20-bit operand handling. */
                    goto op_single;
                }
            }

            /* MSP430X native instructions (0x0000-0x0FFF, 0x1000-0x17FF) */
            int msp430x_op = instr & 0x00f0;

            /* CALLA variants: 0x1340-0x13B0 */
            if ((instr & 0xff00) == 0x1300 && (instr & 0x00f0) >= 0x0040) {
                goto calla_dispatch;
            }

            /* PUSHM/POPM: 0x1400-0x17FF */
            if ((instr & 0xfc00) >= 0x1400 && (instr & 0xfc00) <= 0x1700) {
                goto pushm_popm_dispatch;
            }

            /* RRXX: RRCM/RRAM/RLAM/RRUM — 0000 nntt 01bb dddd
             * bits 7-6 must be 01, bits 5-4 select variant.
             * Exclude dst=R3 (CG2) and dst=R2 (SR) as these are never
             * valid targets and typically indicate data misinterpreted
             * as instructions. */
            if ((instr & 0xf0e0) == 0x0040 && (instr & 0xf) > 3) {
                goto rrxx_dispatch;
            }

            /* MOVA/CMPA/ADDA/SUBA variants */
            int src_reg = (instr >> 8) & 0xf;
            int dst_reg = instr & 0xf;
            pc += 2;

            switch (msp430x_op) {
            case MOVA_IND: {
                uint32_t addr = reg[src_reg];
                reg[dst_reg] = mem_read_mode(cpu, addr, 2) & 0xfffff;
                cpu->cycles += 3;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case MOVA_IND_AUTOINC: {
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                uint32_t addr = reg[src_reg];
                uint32_t val = mem_read_mode(cpu, addr, 2) & 0xfffff;
                reg[src_reg] = (addr + 4) & 0xfffff;
                reg[dst_reg] = val;
                cpu->cycles += 3;
                break;
            }
            case MOVA_ABS2REG: {
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t addr = lo | ((uint32_t)src_reg << 16);
                reg[dst_reg] = mem_read_mode(cpu, addr, 2) & 0xfffff;
                cpu->cycles += 4;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case MOVA_INDX2REG: {
                uint16_t idx = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                int32_t index = sign_extend_16(idx);
                int32_t base = sign_extend_20(reg[src_reg]);
                uint32_t addr = (base + index) & 0xfffff;
                reg[dst_reg] = mem_read_mode(cpu, addr, 2) & 0xfffff;
                cpu->cycles += 4;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case MOVA_REG2ABS: {
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t addr = lo | ((uint32_t)dst_reg << 16);
                mem_write_mode(cpu, addr, reg[src_reg], 2);
                cpu->cycles += 4;
                reg[MSP430_PC] = pc;
                break;
            }
            case MOVA_REG2INDX: {
                uint16_t idx = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                int32_t index = sign_extend_16(idx);
                int32_t base = sign_extend_20(reg[dst_reg]);
                uint32_t addr = (base + index) & 0xfffff;
                mem_write_mode(cpu, addr, reg[src_reg], 2);
                cpu->cycles += 4;
                reg[MSP430_PC] = pc;
                break;
            }
            case MOVA_IMM2REG: {
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t val = lo | ((uint32_t)src_reg << 16);
                reg[dst_reg] = val & 0xfffff;
                cpu->cycles += 2;
                /* Don't clobber PC if destination IS PC (e.g., BRA #addr) */
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case CMPA_IMM: {
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t imm = lo | ((uint32_t)src_reg << 16);
                uint32_t dst = reg[dst_reg];
                uint32_t sr = reg[MSP430_SR] & ~(SR_N | SR_Z | SR_C | SR_V);
                if (dst >= imm) sr |= SR_C;
                if (dst < imm) sr |= SR_N;
                if (dst == imm) sr |= SR_Z;
                int32_t tmp = (int32_t)dst - (int32_t)imm;
                uint32_t b = 0x80000;
                if (((dst ^ (uint32_t)tmp) & b) == 0 && ((dst ^ imm) & b) != 0) {
                    sr |= SR_V;
                }
                write_sr_flags(cpu, sr);
                cpu->cycles += 3;
                reg[MSP430_PC] = pc;
                break;
            }
            case ADDA_IMM: {
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t imm = lo | ((uint32_t)src_reg << 16);
                uint32_t dst_val = reg[dst_reg];
                uint32_t result = dst_val + imm;
                /* Update SR */
                uint32_t sr = reg[MSP430_SR];
                /* Use simplified flag update for address arithmetic */
                sr &= ~(SR_C | SR_Z | SR_N | SR_V);
                if ((result & 0xfffff) == 0) sr |= SR_Z;
                if (result & 0x80000) sr |= SR_N;
                if (result > 0xfffff) sr |= SR_C;
                if (!((dst_val ^ imm) & 0x80000) && ((imm ^ result) & 0x80000)) sr |= SR_V;
                write_sr_flags(cpu, sr);
                reg[dst_reg] = result & 0xfffff;
                cpu->cycles += 3;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case SUBA_IMM: {
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t imm = lo | ((uint32_t)src_reg << 16);
                reg[dst_reg] = (reg[dst_reg] - imm) & 0xfffff;
                cpu->cycles += 3;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case MOVA_REG:
                reg[dst_reg] = reg[src_reg];
                cpu->cycles += 1;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            case CMPA_REG: {
                uint32_t src = reg[src_reg];
                uint32_t dst = reg[dst_reg];
                uint32_t sr = reg[MSP430_SR] & ~(SR_N | SR_Z | SR_C | SR_V);
                if (dst >= src) sr |= SR_C;
                if (dst < src) sr |= SR_N;
                if (dst == src) sr |= SR_Z;
                int32_t tmp = (int32_t)dst - (int32_t)src;
                uint32_t b = 0x80000;
                if (((dst ^ (uint32_t)tmp) & b) == 0 && ((dst ^ src) & b) != 0) {
                    sr |= SR_V;
                }
                write_sr_flags(cpu, sr);
                cpu->cycles += 1;
                reg[MSP430_PC] = pc;
                break;
            }
            case ADDA_REG: {
                uint32_t src = reg[src_reg];
                uint32_t dst_val = reg[dst_reg];
                uint32_t result = dst_val + src;
                uint32_t sr = reg[MSP430_SR];
                sr &= ~(SR_C | SR_Z | SR_N | SR_V);
                if ((result & 0xfffff) == 0) sr |= SR_Z;
                if (result & 0x80000) sr |= SR_N;
                if (result > 0xfffff) sr |= SR_C;
                if (!((dst_val ^ src) & 0x80000) && ((src ^ result) & 0x80000)) sr |= SR_V;
                write_sr_flags(cpu, sr);
                reg[dst_reg] = result & 0xfffff;
                cpu->cycles += 1;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            }
            case SUBA_REG:
                reg[dst_reg] = (reg[dst_reg] - reg[src_reg]) & 0xfffff;
                cpu->cycles += 1;
                if (dst_reg != MSP430_PC) reg[MSP430_PC] = pc;
                break;
            default:
                fprintf(stderr, "Unsupported MSP430X instruction: 0x%04x op=0x%04x at PC=0x%05x\n",
                        instr, msp430x_op, pc - 2);
                reg[MSP430_PC] = pc;
                cpu->cycles += 1;
                break;
            }
            count--;
            goto post_instruction_events;

        rrxx_dispatch: {
            /* RRCM/RRAM/RLAM/RRUM */
            int rr_count = ((instr >> 10) & 0x3) + 1;
            int rr_dst = instr & 0xf;
            int rr_type = instr & RRMASK;
            bool rr_word = (instr & 0x0010) != 0; /* bit 4: 0=.A(20-bit), 1=.W(16-bit) per MSPSim */
            uint32_t dst = reg[rr_dst];
            uint32_t sr = reg[MSP430_SR];
            uint32_t carry = (sr & SR_C) ? 1 : 0;
            uint32_t nxt_carry = 0;

            if (rr_word) {
                dst &= 0xffff;
            }

            pc += 2;
            cpu->cycles += 1 + rr_count;

