nvt/cooja-ng/src/msp430/msp430_cpu.c
            switch (rr_type) {
            case RRCM_OP: {
                uint32_t dst_low = dst & ((1 << rr_count) - 1);
                nxt_carry = (dst & (1 << (rr_count + 1))) ? SR_C : 0;
                dst >>= rr_count;
                if (rr_word) {
                    dst |= (dst_low << (17 - rr_count)) | (carry << (16 - rr_count));
                } else {
                    dst |= (dst_low << (21 - rr_count)) | (carry << (20 - rr_count));
                }
                break;
            }
            case RRAM_OP:
                if (dst & (rr_word ? 0x8000 : 0x80000)) {
                    dst |= (rr_word ? 0xf8000u : 0xf80000u);
                }
                dst >>= (rr_count - 1);
                nxt_carry = (dst & 1) ? SR_C : 0;
                dst >>= 1;
                break;
            case RLAM_OP:
                dst <<= (rr_count - 1);
                nxt_carry = (dst & (rr_word ? 0x8000 : 0x80000)) ? SR_C : 0;
                dst <<= 1;
                break;
            case RRUM_OP:
                dst >>= (rr_count - 1);
                nxt_carry = (dst & 1) ? SR_C : 0;
                dst >>= 1;
                break;
            }

            /* Update Z, N, C flags (matches MSPSim RRXX behavior) */
            {
                uint32_t result = dst & (rr_word ? 0xffff : 0xfffff);
                uint32_t msb = rr_word ? 0x8000 : 0x80000;
                sr = (sr & ~(SR_C | SR_V | SR_Z | SR_N)) | nxt_carry |
                     (result == 0 ? SR_Z : 0) |
                     (result & msb ? SR_N : 0);
                write_sr_flags(cpu, sr);
            }
            reg[rr_dst] = dst & (rr_word ? 0xffff : 0xfffff);
            reg[MSP430_PC] = pc;
            count--;
            goto post_instruction_events;
        }

        calla_dispatch: {
            int dst_register = instr & 0xf;
            int calla_op = instr & CALLA_MASK;
            int sp, dst = -1;
            pc += 2;

            switch (calla_op) {
            case CALLA_REG:
                sp = reg[MSP430_SP] - 2;
                reg[MSP430_SP] = sp;
                dst = reg[dst_register];
                cpu->cycles += 5;
                break;
            case CALLA_INDEX: {
                sp = reg[MSP430_SP] - 2;
                reg[MSP430_SP] = sp;
                dst = reg[dst_register];
                uint16_t idx = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                int32_t index = sign_extend_16(idx);
                dst = (dst + index) & 0xfffff;
                dst = mem_read_mode(cpu, dst, 2);
                cpu->cycles += 5;
                break;
            }
            case CALLA_IMM: {
                sp = reg[MSP430_SP] - 2;
                reg[MSP430_SP] = sp;
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                dst = ((dst_register << 16) | lo) & 0xfffff;
                cpu->cycles += 5;
                break;
            }
            case CALLA_IND: {
                sp = reg[MSP430_SP] - 2;
                reg[MSP430_SP] = sp;
                uint32_t addr = reg[dst_register];
                dst = mem_read_mode(cpu, addr, 2);
                cpu->cycles += 5;
                break;
            }
            case CALLA_ABS: {
                sp = reg[MSP430_SP] - 2;
                reg[MSP430_SP] = sp;
                uint16_t lo = memory[pc] | (memory[pc + 1] << 8);
                pc += 2;
                uint32_t addr = ((dst_register << 16) | lo) & 0xfffff;
                dst = mem_read_mode(cpu, addr, 2);
                cpu->cycles += 7;
                break;
            }
            default:
                fprintf(stderr, "Unsupported CALLA mode: 0x%04x\n", instr);
                reg[MSP430_PC] = pc;
                count--;
                goto post_instruction_events;
            }

            if (dst != -1) {
                sp = reg[MSP430_SP];
                mem_write(cpu, sp, (pc >> 16) & 0xf, true);
                sp -= 2;
                mem_write(cpu, sp, pc & 0xffff, true);
                reg[MSP430_SP] = sp;
                reg[MSP430_PC] = dst & 0xfffff;
            } else {
                reg[MSP430_PC] = pc;
            }
            count--;
            goto post_instruction_events;
        }

        pushm_popm_dispatch: {
            int n = ((instr >> 4) & 0xf) + 1;
            int reg_no = instr & 0xf;
            int pm_op = instr & 0xff00;
            bool is_addr = (pm_op == PUSHM_A || pm_op == POPM_A);
            int size = is_addr ? 4 : 2;
            int sp = reg[MSP430_SP];

            pc += 2;

            if (pm_op == PUSHM_A || pm_op == PUSHM_W) {
                if (is_addr) cpu->cycles += 2;
                for (int i = 0; i < n; i++) {
                    sp -= size;
                    cpu->cycles += 2;
                    mem_write_mode(cpu, sp, reg[reg_no], is_addr ? 2 : 1);
                    reg_no--;
                    if (reg_no < 0) reg_no = 15;
                }
                reg[MSP430_SP] = sp;
            } else {
                /* POPM: Rdst is the LOWEST register. Pop n registers
                 * upward from Rdst to Rdst+n-1.
                 * PUSHM #n, Rhigh pushes Rhigh..Rlow (highest first).
                 * POPM #n, Rlow pops Rlow..Rhigh (lowest first). */
                if (is_addr) cpu->cycles += 2;
                for (int i = 0; i < n; i++) {
                    cpu->cycles += 2;
                    reg[reg_no] = mem_read_mode(cpu, sp, is_addr ? 2 : 1);
                    reg_no++;
                    sp += size;
                    if (reg_no > 15) reg_no = 0;
                }
                reg[MSP430_SP] = sp;
            }
            reg[MSP430_PC] = pc;
            count--;
            goto post_instruction_events;
        }
        } /* end op_msp430x */

        /* ===================================================================
         * Single-operand instructions (opcode 1: 0x1000-0x1FFF)
         * =================================================================== */
        OP_LABEL(op_single): {
            /* MSP430X instructions in the 0x1xxx range overlap with
             * single-op opcodes.  Redirect to op_msp430x for:
             *   0x1800-0x1FFF: extension words (20-bit operand prefix)
             *   0x1300 with bits[7:4]>=4: CALLA variants
             *   0x1400-0x17FF: PUSHM/POPM */
            if (cpu->is_msp430x) {
                if ((instr & 0xf800) == 0x1800)
                    goto op_msp430x;
                if ((instr & 0xff00) == 0x1300 && (instr & 0x00f0) >= 0x0040)
                    goto op_msp430x;
                if ((instr & 0xfc00) >= 0x1400 && (instr & 0xfc00) <= 0x1700)
                    goto op_msp430x;
            }

            int single_op = instr & 0x1380; /* mask to get operation */
            int dst_register = instr & 0xf;
            int ad = (instr >> 4) & 0x3;
            bool bw = (instr & 0x0040) != 0;

