nvt/cooja-ng/src/msp430/msp430_cpu.c
            /* Extension word handling for single-op. Single-op
             * extended instructions have only ONE operand (the dst).
             * Per MSP430X reference and MSPSim (MSP430Core.java:1487
             * and around), bits 3:0 of the ext word hold the operand
             * 19:16. csim previously used bits 10:7 (the source bits)
             * which made indexed/absolute access to upper memory
             * compute the wrong address. */
            int sext = cpu->ext_word;
            uint32_t sext_dst_hi = 0;
            if (sext) {
                sext_dst_hi = sext & 0xf;  /* bits 3:0: operand 19:16 */
                /* A/L and BW interaction same as two-op */
                bool al = (sext >> 6) & 1;  /* bit 6: A/L per MSPSim */
                if (!al) {
                    bw = false;  /* A/L=0: .A mode (20-bit) per MSPSim */
                }
            }

            uint32_t mask = bw ? 0xff : 0xffff;
            uint32_t msb = bw ? 0x80 : 0x8000;
            int mode_bytes = bw ? 1 : 2;

            pc += 2;

            bool dst_reg_mode = false;
            int dst_address = -1;
            int dst = -1;
            int sp;

            /* Pre-decrement SP for PUSH and CALL */
            if (single_op == OP_PUSH || single_op == OP_CALL) {
                sp = reg[MSP430_SP] - 2;
                reg[MSP430_SP] = sp;
            } else {
                sp = reg[MSP430_SP];
            }

            /* Resolve destination */
            if ((dst_register == MSP430_CG1 && ad > AM_INDEX) || dst_register == MSP430_CG2) {
                dst_reg_mode = true;
                cpu->cycles += 1;
            } else {
                switch (ad) {
                case AM_REG:
                    dst_reg_mode = true;
                    cpu->cycles += 1;
                    break;
                case AM_INDEX: {
                    uint16_t idx16 = memory[pc] | (memory[pc + 1] << 8);
                    pc += 2;
                    if (dst_register == MSP430_SR) {
                        /* Absolute addressing mode */
                        dst_address = sext ? ((sext_dst_hi << 16) | idx16) & 0xfffff
                                           : (uint32_t)idx16;
                    } else {
                        uint32_t rval = reg[dst_register];
                        if (sext) {
                            uint32_t idx20 = ((sext_dst_hi << 16) | idx16) & 0xfffff;
                            dst_address = (rval + idx20) & 0xfffff;
                        } else {
                            int32_t idx = sign_extend_16(idx16);
                            if (rval <= 0xffff) {
                                dst_address = (rval + idx) & 0xffff;
                            } else {
                                dst_address = (rval + idx) & 0xfffff;
                            }
                        }
                    }
                    cpu->cycles += 4;
                    break;
                }
                case AM_IND_REG:
                    dst_address = reg[dst_register];
                    cpu->cycles += 3;
                    break;
                case AM_IND_AUTOINC:
                    if (dst_register == MSP430_PC) {
                        /* Immediate mode */
                        dst = memory[pc] | (memory[pc + 1] << 8);
                        if (sext) dst = ((sext_dst_hi << 16) | dst) & 0xfffff;
                        pc += 2;
                        dst_address = -1;
                    } else {
                        dst_address = reg[dst_register];
                        reg[dst_register] = dst_address + mode_bytes;
                    }
                    cpu->cycles += 3;
                    break;
                }
            }

            /* Read value */
            if (dst_reg_mode) {
                if (dst_register == MSP430_CG2) {
                    dst = cg2_values[ad];
                } else if (dst_register == MSP430_CG1 && ad > AM_INDEX) {
                    dst = cg1_values[ad];
                } else {
                    dst = reg[dst_register];
                }
                dst &= mask;
            } else if (dst == -1 && dst_address != -1) {
                dst = mem_read(cpu, dst_address, !bw);
                if (bw) dst &= 0xff;
            }

            bool write_back = false;
            bool update_status = true;
            uint32_t sr = reg[MSP430_SR];
            uint32_t nxt_carry;

            switch (single_op) {
            case OP_RRC:
                nxt_carry = (dst & 1) ? SR_C : 0;
                dst = dst >> 1;
                dst |= (sr & SR_C) ? msb : 0;
                write_back = true;
                write_sr_flags(cpu, (sr & ~(SR_C | SR_V)) | nxt_carry);
                break;
            case OP_SWPB: {
                int tmp = dst;
                dst = ((tmp >> 8) & 0xff) | ((tmp << 8) & 0xff00);
                write_back = true;
                update_status = false;
                break;
            }
            case OP_RRA:
                nxt_carry = (dst & 1) ? SR_C : 0;
                dst = (dst & msb) | (dst >> 1);
                write_back = true;
                write_sr_flags(cpu, (sr & ~(SR_C | SR_V)) | nxt_carry);
                break;
            case OP_SXT:
                dst = (dst & 0x80) ? (dst | 0xfff00) : (dst & 0x7f);
                write_back = true;
                sr &= ~(SR_C | SR_V);
                if (dst != 0) sr |= SR_C;
                write_sr_flags(cpu, sr);
                mask = 0xffff; /* SXT result is word-size */
                msb = 0x8000;
                break;
            case OP_PUSH:
                mem_write(cpu, sp, dst, !bw);
                cpu->cycles += (ad == AM_REG || ad == AM_IND_AUTOINC) ? 2 : 1;
                write_back = false;
                update_status = false;
                break;
            case OP_CALL: {
                uint32_t cur_pc = pc;
                reg[MSP430_PC] = pc;
                mem_write(cpu, sp, cur_pc & 0xffff, true);
                reg[MSP430_PC] = dst & 0xffff;
                pc = dst & 0xffff;
                cpu->cycles += (ad == AM_REG) ? 3 : (ad == AM_IND_AUTOINC) ? 2 : 1;
                write_back = false;
                update_status = false;
                break;
            }
            case OP_RETI: {
                cpu->serviced_interrupt = -1;
                sp = reg[MSP430_SP];
                sr = mem_read(cpu, sp, true);
                write_sr(cpu, sr & 0x0fff);
                sp += 2;
                uint32_t ret_pc = mem_read(cpu, sp, true) | ((sr & 0xf000) << 4);
                reg[MSP430_PC] = ret_pc;
                pc = ret_pc;
                sp += 2;
                reg[MSP430_SP] = sp;
                write_back = false;
                update_status = false;
                cpu->cycles += 4;
                handle_pending_interrupts(cpu);
                break;
            }
            default:
                fprintf(stderr, "Unknown single-op: 0x%04x\n", instr);
                break;
            }

            /* Write back result */
            dst &= mask;
            if (write_back) {
                if (dst_reg_mode) {
                    reg[dst_register] = dst;
                } else if (dst_address != -1) {
                    mem_write(cpu, dst_address, dst, !bw);
                }
            }

            /* Update status flags (Z, N) */
            if (update_status) {
                sr = reg[MSP430_SR];
                sr = (sr & ~(SR_Z | SR_N)) |
                     ((dst == 0) ? SR_Z : 0) |
                     ((dst & msb) ? SR_N : 0);
                write_sr_flags(cpu, sr);
            }

            if (single_op != OP_CALL && single_op != OP_RETI) {
                reg[MSP430_PC] = pc;
            }
            cpu->ext_word = 0;
            count--;
            goto post_instruction_events;
        }

        /* ===================================================================
         * Jump instructions (opcodes 2-3: 0x2000-0x3FFF)
         * =================================================================== */
        OP_LABEL(op_jump): {
            pc += 2;
            cpu->cycles += 2;

            int condition = (instr >> 10) & 0x7;
            int offset = instr & 0x3ff;
            /* Sign-extend 10-bit offset and multiply by 2 */
            if (offset & 0x200) offset |= 0xfc00;
            int32_t jump_offset = ((int16_t)offset) * 2;

