nvt/cooja-ng/src/msp430/msp430_cpu.c
            uint32_t sr = reg[MSP430_SR];
            bool jump;

            switch (condition) {
            case JMP_JNE: jump = (sr & SR_Z) == 0; break;
            case JMP_JEQ: jump = (sr & SR_Z) != 0; break;
            case JMP_JNC: jump = (sr & SR_C) == 0; break;
            case JMP_JC:  jump = (sr & SR_C) != 0; break;
            case JMP_JN:  jump = (sr & SR_N) != 0; break;
            case JMP_JGE: jump = ((sr & SR_N) != 0) == ((sr & SR_V) != 0); break;
            case JMP_JL:  jump = ((sr & SR_N) != 0) != ((sr & SR_V) != 0); break;
            case JMP_JMP: jump = true; break;
            default: jump = false; break;
            }

            if (jump) {
                pc = (pc + jump_offset) & (cpu->is_msp430x ? 0xfffff : 0xffff);
            }
            reg[MSP430_PC] = pc;
            count--;
            goto post_instruction_events;
        }

        /* ===================================================================
         * Two-operand instructions (opcodes 4-F)
         *
         * Format: opcode(4) | src_reg(4) | Ad(1) | BW(1) | As(2) | dst_reg(4)
         * =================================================================== */

        extended_twoop: ; /* label for extension-word dispatch */

        /* Process all two-op instructions through shared operand resolution,
           then dispatch to individual operations */
        #define TWO_OP_BODY(operation) \
        OP_LABEL(op_##operation):

        TWO_OP_BODY(mov)
        TWO_OP_BODY(add)
        TWO_OP_BODY(addc)
        TWO_OP_BODY(subc)
        TWO_OP_BODY(sub)
        TWO_OP_BODY(cmp)
        TWO_OP_BODY(dadd)
        TWO_OP_BODY(bit)
        TWO_OP_BODY(bic)
        TWO_OP_BODY(bis)
        TWO_OP_BODY(xor)
        TWO_OP_BODY(and)
        {
            int src_register = (instr >> 8) & 0xf;
            int dst_register = instr & 0xf;
            int ad = (instr >> 7) & 0x1;
            bool bw = (instr & 0x0040) != 0;
            int as = (instr >> 4) & 0x3;

            /* Extension word: determine actual operand width.
             * A/L=0, BW=0: .W (word 16-bit)
             * A/L=0, BW=1: .A (address 20-bit)
             * A/L=1, BW=0: reserved (treat as .W)
             * A/L=1, BW=1: .B (byte 8-bit) */
            int ext = cpu->ext_word;
            bool is_addr_mode = false;  /* .A (20-bit) mode */
            uint32_t ext_src_hi = 0;    /* source bits 19:16 */
            uint32_t ext_dst_hi = 0;    /* destination bits 19:16 */
            if (ext) {
                bool al = (ext >> 6) & 1;  /* bit 6: A/L per MSPSim (0=.A, 1=.W/.B) */
                ext_src_hi = (ext >> 7) & 0xf;  /* bits 10:7: src 19:16 per MSPSim */
                ext_dst_hi = ext & 0xf;  /* bits 3:0: dst 19:16 */
                if (!al) {
                    /* A/L=0: .A mode (20-bit) regardless of BW — per MSPSim wordx20 */
                    is_addr_mode = true;
                    bw = false;
                }
                /* A/L=1: follow instruction BW bit (0=.W, 1=.B) — no change needed */
            }

            uint32_t mask = is_addr_mode ? 0xfffff : (bw ? 0xff : 0xffff);
            uint32_t msb_bit = is_addr_mode ? 0x80000 : (bw ? 0x80 : 0x8000);
            int mode_bytes = is_addr_mode ? 4 : (bw ? 1 : 2);
            bool dst_reg_mode = (ad == 0);

            int src = 0;
            int dst = 0;
            int dst_address = -1;
            bool src_is_cg = false;

            pc += 2;

            /* ---- FAST PATH: reg/CG source, register destination ---- */
            if (__builtin_expect(dst_reg_mode && cpu->ext_word == 0, 1)) {
                if (src_register == MSP430_CG2) {
                    src = cg2_values[as];
                    if (bw && as == 3) src = 0xff;
                    cpu->cycles += 1;
                } else if (src_register == MSP430_CG1 && as >= 2) {
                    src = cg1_values[as];
                    cpu->cycles += 1;
                } else if (as == AM_REG) {
                    src = reg[src_register] & mask;
                    cpu->cycles += 1;
                    if (dst_register == MSP430_PC) cpu->cycles += 1;
                } else {
                    goto twoop_slow;
                }
                if (op != OP_MOV) dst = reg[dst_register] & mask;
                goto twoop_alu;
            }

            twoop_slow: ;
            /* --- Resolve source operand --- */
            if (src_register == MSP430_CG2) {
                /* CG2 (R3): constant generator */
                src = cg2_values[as];
                if (bw && as == 3) src = 0xff; /* #-1 in byte mode */
                src_is_cg = true;
                cpu->cycles += dst_reg_mode ? 1 : 4;
            } else if (src_register == MSP430_CG1 && as >= 2) {
                /* CG1 (R2/SR): As=2→4, As=3→8 */
                src = cg1_values[as];
                src_is_cg = true;
                cpu->cycles += dst_reg_mode ? 1 : 4;
            } else {
                switch (as) {
                case AM_REG:
                    src = reg[src_register] & mask;
                    cpu->cycles += dst_reg_mode ? 1 : 4;
                    if (dst_register == MSP430_PC) cpu->cycles += 1;
                    break;
                case AM_INDEX: {
                    uint16_t idx16 = memory[pc] | (memory[pc + 1] << 8);
                    pc += 2;
                    uint32_t addr;
                    if (src_register == MSP430_SR) {
                        /* Absolute addressing mode: address is just the index word.
                         * With extension word, upper bits extend to 20-bit. */
                        addr = ext ? ((ext_src_hi << 16) | idx16) & 0xfffff
                                   : (uint32_t)idx16;
                    } else {
                        uint32_t rval = reg[src_register];
                        if (ext) {
                            /* Extension word: index is 20-bit unsigned,
                             * formed from ext upper bits + 16-bit index */
                            uint32_t idx20 = ((ext_src_hi << 16) | idx16) & 0xfffff;
                            addr = (rval + idx20) & 0xfffff;
                        } else {
                            int32_t idx = sign_extend_16(idx16);
                            if (rval <= 0xffff) {
                                addr = (rval + idx) & 0xffff;
                            } else {
                                addr = (rval + idx) & 0xfffff;
                            }
                        }
                    }
                    src = is_addr_mode ? mem_read_mode(cpu, addr, 2)
                                       : mem_read(cpu, addr, !bw);
                    if (bw) src &= 0xff;
                    if (is_addr_mode) src &= 0xfffff;
                    cpu->cycles += dst_reg_mode ? 3 : 6;
                    break;
                }
                case AM_IND_REG:
                    src = is_addr_mode ? mem_read_mode(cpu, reg[src_register], 2)
                                       : mem_read(cpu, reg[src_register], !bw);
                    if (bw) src &= 0xff;
                    if (is_addr_mode) src &= 0xfffff;
                    cpu->cycles += dst_reg_mode ? 2 : 5;
                    break;
                case AM_IND_AUTOINC:
                    if (src_register == MSP430_PC) {
                        /* Immediate mode: word follows instruction.
                         * With extension word, upper bits extend to 20-bit. */
                        src = memory[pc] | (memory[pc + 1] << 8);
                        if (ext) src = ((ext_src_hi << 16) | src) & 0xfffff;
                        if (bw) src &= 0xff;
                        pc += 2;
                    } else {
                        uint32_t addr = reg[src_register];
                        src = is_addr_mode ? mem_read_mode(cpu, addr, 2)
                                           : mem_read(cpu, addr, !bw);
                        if (bw) src &= 0xff;
                        if (is_addr_mode) src &= 0xfffff;
                        reg[src_register] = addr + mode_bytes;
                    }
                    cpu->cycles += dst_reg_mode ? 2 : 5;
                    if (dst_register == MSP430_PC) cpu->cycles += 1;
                    break;
                }
            }

