nvt/cooja-ng/src/msp430/msp430_cpu.c
            /* --- Resolve destination operand --- */
            if (dst_reg_mode) {
                if (op != OP_MOV) {
                    dst = reg[dst_register] & mask;
                }
            } else {
                /* Indexed destination */
                if (dst_register == MSP430_SR) {
                    /* Absolute addressing mode.
                     * With extension word, upper bits extend to 20-bit. */
                    uint16_t addr16 = memory[pc] | (memory[pc + 1] << 8);
                    dst_address = ext ? ((ext_dst_hi << 16) | addr16) & 0xfffff
                                      : addr16;
                    pc += 2;
                } else {
                    uint32_t rval = reg[dst_register];
                    uint16_t idx16 = memory[pc] | (memory[pc + 1] << 8);
                    pc += 2;
                    if (ext) {
                        uint32_t idx20 = ((ext_dst_hi << 16) | idx16) & 0xfffff;
                        dst_address = (rval + idx20) & 0xfffff;
                    } else {
                        int32_t idx = sign_extend_16(idx16);
                        if (rval <= 0xffff) {
                            dst_address = (rval + idx) & 0xffff;
                        } else {
                            dst_address = (rval + idx) & 0xfffff;
                        }
                    }
                }
                if (op != OP_MOV) {
                    dst = is_addr_mode ? mem_read_mode(cpu, dst_address, 2)
                                       : mem_read(cpu, dst_address, !bw);
                    if (bw) dst &= 0xff;
                    if (is_addr_mode) dst &= 0xfffff;
                }
            }

            /* --- Repeat count from extension word --- */
            int repeats = 1;
            bool zero_carry = false;
            if (ext && dst_reg_mode) {
                bool rep_in_reg = (ext >> 7) & 1;  /* bit 7: repeat count in register */
                int ext3_0 = ext & 0xf;
                if (rep_in_reg) {
                    repeats = 1 + (reg[ext3_0] & 0xf);
                } else {
                    repeats = 1 + ext3_0;
                }
                zero_carry = (ext & 0x20) != 0;  /* bit 5: ZC (zero carry) */
            }

            /* --- Execute ALU operation (with repeat loop) --- */
            twoop_alu: ;
            /* Re-initialize repeats/zero_carry here because the fast path
             * jumps to twoop_alu via goto, skipping the initialization
             * at the declaration site (undefined behavior in C). */
            if (cpu->ext_word == 0) {
                repeats = 1;
                zero_carry = false;
            }
            bool write_result = false;
            bool update_status = true;
            uint32_t sr = reg[MSP430_SR];

            for (int rep = 0; rep < repeats; rep++) {
            /* For repeats > 1, re-read sr and optionally clear carry */
            if (rep > 0) {
                sr = reg[MSP430_SR];
                if (zero_carry) sr &= ~SR_C;
                /* Re-read dst from register for repeated operations */
                if (dst_reg_mode && op != OP_MOV)
                    dst = reg[dst_register] & mask;
                /* Re-read src from register too — when an X-mode RPT
                 * repeats e.g. ADDX R14,R14, src and dst share the same
                 * register, and src must reflect the live register
                 * value each iteration. Without this, src stays at the
                 * pre-loop value (e.g. 3) while dst doubles, producing
                 * 3 + 3 + 3 + 3 = 15 instead of 3 << 4 = 48.
                 *
                 * For non-register addressing modes (immediate, indexed,
                 * autoincrement) src was fetched once at instruction
                 * start; per the MSP430X spec, only register operands
                 * are re-read on each repeat. */
                if (!src_is_cg && as == AM_REG)
                    src = reg[src_register] & mask;
            }
            write_result = false;
            update_status = true;

            switch (op) {
            case OP_MOV:
                dst = src;
                write_result = true;
                update_status = false;
                break;

            case OP_ADD: {
                sr &= ~(SR_V | SR_C);
                uint32_t tmp = (src ^ dst) & msb_bit;
                dst = dst + src;
                if ((uint32_t)dst > mask) sr |= SR_C;
                if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
                write_sr_flags(cpu, sr);
                write_result = true;
                break;
            }

            case OP_ADDC: {
                int carry = (sr & SR_C) ? 1 : 0;
                sr &= ~(SR_V | SR_C);
                uint32_t tmp = (src ^ dst) & msb_bit;
                dst = dst + src + carry;
                if ((uint32_t)dst > mask) sr |= SR_C;
                if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
                write_sr_flags(cpu, sr);
                write_result = true;
                break;
            }

            case OP_SUB: {
                /* Match MSPSim: 16-bit complement even for byte mode */
                src = (src ^ 0xffff) & 0xffff;
                sr &= ~(SR_V | SR_C);
                uint32_t tmp = (src ^ dst) & msb_bit;
                dst = dst + src + 1;
                if ((uint32_t)dst > mask) sr |= SR_C;
                if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
                write_sr_flags(cpu, sr);
                write_result = true;
                break;
            }

            case OP_SUBC: {
                int carry = (sr & SR_C) ? 1 : 0;
                src = (src ^ 0xffff) & 0xffff;
                sr &= ~(SR_V | SR_C);
                uint32_t tmp = (src ^ dst) & msb_bit;
                dst = dst + src + carry;
                if ((uint32_t)dst > mask) sr |= SR_C;
                if (tmp == 0 && ((src ^ dst) & msb_bit)) sr |= SR_V;
                write_sr_flags(cpu, sr);
                write_result = true;
                break;
            }

            case OP_CMP: {
                sr = (sr & ~(SR_C | SR_V)) | ((uint32_t)dst >= (uint32_t)src ? SR_C : 0);
                int tmp = dst - src;
                if (((src ^ tmp) & msb_bit) == 0 && ((src ^ dst) & msb_bit) != 0) {
                    sr |= SR_V;
                }
                write_sr_flags(cpu, sr);
                dst = tmp;
                write_result = false;
                break;
            }

            case OP_DADD: {
                dst = dst + src + ((sr & SR_C) ? 1 : 0);
                write_result = true;
                break;
            }

