nvt/cooja-ng/src/msp430/msp430_cpu.c
            case OP_BIT: {
                dst = src & dst;
                sr = (sr & ~(SR_C | SR_V)) | ((dst != 0) ? SR_C : 0);
                write_sr_flags(cpu, sr);
                write_result = false;
                break;
            }

            case OP_BIC:
                dst = (~src) & dst;
                write_result = true;
                update_status = false;
                break;

            case OP_BIS:
                dst = src | dst;
                write_result = true;
                update_status = false;
                break;

            case OP_XOR: {
                sr &= ~(SR_C | SR_V);
                if ((src & msb_bit) && (dst & msb_bit)) sr |= SR_V;
                dst = src ^ dst;
                if (dst != 0) sr |= SR_C;
                write_sr_flags(cpu, sr);
                write_result = true;
                break;
            }

            case OP_AND: {
                sr &= ~(SR_C | SR_V);
                dst = src & dst;
                if (dst != 0) sr |= SR_C;
                write_sr_flags(cpu, sr);
                write_result = true;
                break;
            }
            } /* end switch(op) */

            /* Mask result */
            dst &= mask;

            /* Write back — also mask to 20 bits for MSP430X register writes
             * (MSPSim writeRegister always does value &= 0xfffff) */
            if (write_result) {
                if (dst_reg_mode) {
                    if (dst_register == MSP430_SR) {
                        write_sr(cpu, dst);
                    } else {
                        reg[dst_register] = dst & 0xfffff;
                    }
                } else {
                    if (is_addr_mode) {
                        mem_write_mode(cpu, dst_address, dst, 2);
                    } else {
                        mem_write(cpu, dst_address, dst, !bw);
                    }
                }
            }

            /* Update Z, N flags */
            if (update_status) {
                sr = reg[MSP430_SR];
                sr = (sr & ~(SR_Z | SR_N)) |
                     ((dst == 0) ? SR_Z : 0) |
                     ((dst & msb_bit) ? SR_N : 0);
                write_sr_flags(cpu, sr);
            }

            } /* end repeat loop */

            /* Don't overwrite PC if the instruction already wrote to it */
            if (!(dst_reg_mode && dst_register == MSP430_PC && write_result)) {
                reg[MSP430_PC] = pc;
            }
            cpu->ext_word = 0;
            count--;
            goto post_instruction_events;
        }

        /* Process events AFTER instruction execution (matching MSPSim line 2080).
         * This ensures timer events fire after the instruction that crossed
         * the event cycle, not before the next instruction. Critical for
         * TSCH: after RETI, the interrupted context executes one instruction
         * before timer events trigger the next ISR. */
        post_instruction_events:
        if (cpu->cycles >= cpu->next_event_cycle) {
            execute_events(cpu);
        }

#if !defined(__GNUC__) && !defined(__clang__)
        } /* end switch */
#endif
    } /* end while */

    return count;
}
